<?php
require('../../../fpdf/mbfpdf.php');

//*******************ÆþÎÏ²Õ½ê*********************

//Í¾Çò
$left_margin = 40;
$top_margin = 40;

//¥Ú¡¼¥¸¥µ¥¤¥º
//A3
$pdf=new MBFPDF('L','pt','A3');

//¥¿¥¤¥È¥ë
$title = "¥Ð¥Ã¥ÁÉ½";
$page_count = "1¥Ú¡¼¥¸"; 

//²¾¤Î»þ¹ï
$time = "ÂÐ¾Ý´ü´Ö¡§2005Ç¯04·î01Æü¡¡18:00¡Á2005Ç¯04·î02Æü¡¡18:00";
$person ="¥ª¥Ú¥ì¡¼¥¿¡§Ã´Åö¼ÔA";
$money1 ="¡ÚÇä¾å¹ç·×¡Û2,516,788¡¡¡ÚÆþ¶â¹ç·×¡Û97,440";
$money2 ="¡Ú»ÅÆþ¹ç·×¡Û        0¡¡¡Ú»ÙÊ§¹ç·×¡Û97,440";

//***********************************************
$pdf->AddMBFont(GOTHIC ,'SJIS');
$pdf->SetFont(GOTHIC, '', 9);
$pdf->SetAutoPageBreak(false);
$pdf->AddPage();
$date = date("°õºþ»þ¹ï¡¡YÇ¯m·îdÆü¡¡H:i");
//*******************ÆþÎÏ²Õ½ê*********************

//A3¤Î²£Éý¤Ï¡¢1110
$pdf->SetXY($left_margin,$top_margin);
$pdf->Cell(1110, 14, $title, '0', '1', 'C');
$pdf->SetXY($left_margin,$top_margin);
$pdf->Cell(1110, 14, $page_count, '0', '1', 'R');
$pdf->SetXY($left_margin,$top_margin);
$pdf->Cell(1110, 14, $person, '0', '1', 'L');
$pdf->SetXY($left_margin,$top_margin+14);
$pdf->Cell(1110, 14, $date, '0', '1', 'R');
$pdf->SetXY($left_margin,$top_margin+14);
$pdf->Cell(555, 14, $money1, '0', '1', 'L');
$pdf->SetXY($left_margin,$top_margin+28);
$pdf->Cell(555, 14, $money2, '0', '1', 'L');
$pdf->SetXY($left_margin+555,$top_margin+28);
$pdf->Cell(555, 14, $time, '0', '2', 'R');

//¹àÌÜÌ¾¡¦Éý¡¦align
$list[0] = array("60","NO","C");
$list[1] = array("230","¼è°ú¶èÊ¬","C");
$list[2] = array("230","","C");
$list[3] = array("230","","C");
$list[4] = array("120","ÌÀºÙ·ï¿ô","C");
$list[5] = array("120","¶â³Û","C");
$list[6] = array("120","·î¼¡Îß·×","C");

$data_list[1] = array("1","¡ÚÇä¾åÌÀºÙ¡Û","","","","","");
$data_list[2] = array("2","11-01","¡Ú³ÝÇä¾å¡Û","¡Ú¥ê¥Ô¡¼¥È¡Û","81","642,210","1,586,420");
$data_list[3] = array("3","11-02","¡Ú³ÝÇä¾å¡Û","¡Ú ¾¦¡¡ÉÊ ¡Û","8","485,500","851,450");
$data_list[4] = array("4","11-03","¡Ú³ÝÇä¾å¡Û","¡Ú¥ì¥ó¥¿¥ë¡Û","27","146,400","146,400");
$data_list[5] = array("5","11-04","¡Ú³ÝÇä¾å¡Û","¡Ú ¤½¤ÎÂ¾ ¡Û","4","-75,640","-75,400");
$data_list[6] = array("6","11-05","¡Ú³ÝÇä¾å¡Û","¡Ú ÅÁÉ¼¾ÃÈñÀÇ ¡Û","40","59,924","125,444");
$data_list[7] = array("7","","","¡Ú ÈÎÇä´ÉÍý³°¾¦ÉÊ ¡Û","5","15,360","36,405");
$data_list[8] = array("8","","","¡Ú ¹ç¡¡·× ¡Û","165","1,258,394","2,634,314");
$data_list[9] = array("9","","","","","","");
$data_list[10] = array("10","61-01","¡Ú¸½¶âÇä¾å¡Û","¡Ú¥ê¥Ô¡¼¥È¡Û","81","642,210","1,586,420");
$data_list[11] = array("11","61-02","¡Ú¸½¶âÇä¾å¡Û","¡Ú ¾¦¡¡ÉÊ ¡Û","8","485,500","851,450");
$data_list[12] = array("12","61-03","¡Ú¸½¶âÇä¾å¡Û","¡Ú¥ì¥ó¥¿¥ë¡Û","27","146,400","146,400");
$data_list[13] = array("13","61-04","¡Ú¸½¶âÇä¾å¡Û","¡Ú ¤½¤ÎÂ¾ ¡Û","4","-75,640","-75,400");
$data_list[14] = array("14","61-05","¡Ú¸½¶âÇä¾å¡Û","¡Ú ÅÁÉ¼¾ÃÈñÀÇ ¡Û","40","59,924","125,444");
$data_list[15] = array("15","","","¡Ú ÈÎÇä´ÉÍý³°¾¦ÉÊ ¡Û","5","15,360","36,405");
$data_list[16] = array("16","","","¡Ú ¹ç¡¡·× ¡Û","165","1,258,394","2,634,314");
$data_list[17] = array("17","¡Ú»ÅÆþÌÀºÙ¡Û","","","","","");
$data_list[18] = array("18","21-01","¡Ú³Ý»ÅÆþ¡Û","¡Ú¥ê¥Ô¡¼¥È¡Û","34","0","0");
$data_list[19] = array("19","21-02","¡Ú³Ý»ÅÆþ¡Û","¡Ú ÅÁÉ¼¾ÃÈñÀÇ ¡Û","6","0","0");
$data_list[20] = array("20","","","¡Ú ¹ç¡¡·× ¡Û","40","0","0");
$data_list[21] = array("21","¡ÚÆþ¶âÌÀºÙ¡Û","","","","","");
$data_list[22] = array("22","","¡Ú¿¶¹þÆþ¶â¡Û","","","","");
$data_list[23] = array("23","32","0001","¤ß¤º¤Û¶ä¹Ô¡ÊÅöºÂ¡Ë","2","69,090","69,090");
$data_list[24] = array("24","32","0004","²£ÉÍ¶ä¹Ô¡ÊÅöºÂ¡Ë","1","11,655","11,655");
$data_list[25] = array("25","32","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","2","12,390","12,390");
$data_list[26] = array("26","32","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","5","93,135","93,135");
$data_list[27] = array("27","","¡Ú¼ê¿ôÎÁ¡Û","","","","");
$data_list[28] = array("28","35","0001","¤ß¤º¤Û¶ä¹Ô¡ÊÅöºÂ¡Ë","1","420","420");
$data_list[29] = array("29","35","0004","²£ÉÍ¶ä¹Ô¡ÊÅöºÂ¡Ë","1","525","525");
$data_list[30] = array("30","35","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","1","210","210");
$data_list[31] = array("31","35","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","3","1,155","1,155");
$data_list[32] = array("32","37","¡Ú ¤½¤ÎÂ¾Æþ¶â ¡Û","","","","");
$data_list[33] = array("33","","","¡Ú ¤½¤ÎÂ¾Æþ¶â·× ¡Û","1","3,150","3,150");

$data_list[34] = array("34","¡Ú»ÙÊ§ÌÀºÙ¡Û","","","","","");
$data_list[35] = array("35","","¡Ú¿¶¹þÆþ¶â¡Û","","","","");
$data_list[36] = array("36","32","0002","¤ß¤º¤Û¶ä¹Ô","2","69,090","69,090");
$data_list[37] = array("37","32","0003","²£ÉÍ¶ä¹Ô","1","11,655","11,655");
$data_list[38] = array("38","32","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","2","12,390","12,390");
$data_list[39] = array("39","32","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","5","93,135","93,135");
$data_list[40] = array("40","","¡Ú¼ê¿ôÎÁ¡Û","","","","");
$data_list[41] = array("41","35","0001","¤ß¤º¤Û¶ä¹Ô¡ÊÅöºÂ¡Ë","1","420","420");
$data_list[42] = array("42","35","0004","²£ÉÍ¶ä¹Ô¡ÊÅöºÂ¡Ë","1","525","525");
$data_list[43] = array("43","35","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","1","210","210");
$data_list[44] = array("44","35","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","3","1,155","1,155");
$data_list[45] = array("45","37","¡Ú ¤½¤ÎÂ¾Æþ¶â ¡Û","","","","");
$data_list[46] = array("46","","","¡Ú ¤½¤ÎÂ¾Æþ¶â·× ¡Û","1","3,150","3,150");

//align(¥Ç¡¼¥¿)
$data_align[0] = "R";
$data_align[1] = "L";
$data_align[2] = "L";
$data_align[3] = "L";
$data_align[4] = "R";
$data_align[5] = "R";
$data_align[6] = "R";

//***********************************************

//¹àÌÜÉ½¼¨
$posY = $pdf->GetY();
$pdf->SetXY($left_margin, $posY);
for($i=0;$i<count($list)-1;$i++)
{
	$pdf->Cell($list[$i][0], 14, $list[$i][1], '1', '0', $list[$i][2]);
}
$pdf->Cell($list[$i][0], 14, $list[$i][1], '1', '2', $list[$i][2]);

//¥Ç¡¼¥¿É½¼¨
for($j=1;$j<=count($data_list);$j++)
{
	//ÇØ·Ê¿§ÊÑ¹¹¥Õ¥é¥°
	$color_flg = false;
	$posY = $pdf->GetY();
	$pdf->SetXY($left_margin, $posY);
	if($j == 8 || $j == 16 || $j == 20 || $j == 26 || $j == 31 || $j == 33 || $j == 39 || $j == 44 || $j == 46){
		$pdf->SetFillColor(213,213,213);
		$color_flg = true;
	}else if($j == 1 || $j == 17 || $j == 21 || $j == 34){
		$pdf->SetFillColor(145,145,145);
		$color_flg = true;
	}else if($j == 7 || $j == 15){
		$pdf->SetFillColor(255,255,153);
		$color_flg = true;
	}
	for($x=0;$x<6;$x++)
	{
		if($color_flg == true){
			$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '0', $data_align[$x],'1');
		}else{
			$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '0', $data_align[$x]);
		}
	}
	if($color_flg == true){
		$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '2', $data_align[$x],'1');
	}else{
		$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '2', $data_align[$x]);
	}
}

//********************Á´¼Ò·×****************************
//¥¿¥¤¥È¥ë
$title = "¥Ð¥Ã¥ÁÉ½";
$page_count = "2¥Ú¡¼¥¸"; 

$time = "ÂÐ¾Ý´ü´Ö¡§2005Ç¯04·î01Æü¡¡18:00¡Á2005Ç¯04·î02Æü¡¡18:00";
$person ="¥ª¥Ú¥ì¡¼¥¿¡§Á´¼Ò·×";
$money1 ="¡ÚÇä¾å¹ç·×¡Û2,516,788¡¡¡ÚÆþ¶â¹ç·×¡Û97,440";
$money2 ="¡Ú»ÅÆþ¹ç·×¡Û        0¡¡¡Ú»ÙÊ§¹ç·×¡Û97,440";

$pdf->AddPage();

//A3¤Î²£Éý¤Ï¡¢1110
$pdf->SetXY($left_margin,$top_margin);
$pdf->Cell(1110, 14, $title, '0', '1', 'C');
$pdf->SetXY($left_margin,$top_margin);
$pdf->Cell(1110, 14, $page_count, '0', '1', 'R');
$pdf->SetXY($left_margin,$top_margin);
$pdf->Cell(1110, 14, $person, '0', '1', 'L');
$pdf->SetXY($left_margin,$top_margin+14);
$pdf->Cell(1110, 14, $date, '0', '1', 'R');
$pdf->SetXY($left_margin,$top_margin+14);
$pdf->Cell(555, 14, $money1, '0', '1', 'L');
$pdf->SetXY($left_margin,$top_margin+28);
$pdf->Cell(555, 14, $money2, '0', '1', 'L');
$pdf->SetXY($left_margin+555,$top_margin+28);
$pdf->Cell(555, 14, $time, '0', '2', 'R');

//¹àÌÜÌ¾¡¦Éý¡¦align
$list[0] = array("60","NO","C");
$list[1] = array("230","¼è°ú¶èÊ¬","C");
$list[2] = array("230","","C");
$list[3] = array("230","","C");
$list[4] = array("120","ÌÀºÙ·ï¿ô","C");
$list[5] = array("120","¶â³Û","C");
$list[6] = array("120","·î¼¡Îß·×","C");

$data_list[1] = array("1","¡ÚÇä¾åÌÀºÙ¡Û","","","","","");
$data_list[2] = array("2","11-01","¡Ú³ÝÇä¾å¡Û","¡Ú¥ê¥Ô¡¼¥È¡Û","81","642,210","1,586,420");
$data_list[3] = array("3","11-02","¡Ú³ÝÇä¾å¡Û","¡Ú ¾¦¡¡ÉÊ ¡Û","8","485,500","851,450");
$data_list[4] = array("4","11-03","¡Ú³ÝÇä¾å¡Û","¡Ú¥ì¥ó¥¿¥ë¡Û","27","146,400","146,400");
$data_list[5] = array("5","11-04","¡Ú³ÝÇä¾å¡Û","¡Ú ¤½¤ÎÂ¾ ¡Û","4","-75,640","-75,400");
$data_list[6] = array("6","11-05","¡Ú³ÝÇä¾å¡Û","¡Ú ÅÁÉ¼¾ÃÈñÀÇ ¡Û","40","59,924","125,444");
$data_list[7] = array("7","","","¡Ú ÈÎÇä´ÉÍý³°¾¦ÉÊ ¡Û","5","15,360","36,405");
$data_list[8] = array("8","","","¡Ú ¹ç¡¡·× ¡Û","165","1,258,394","2,634,314");
$data_list[9] = array("9","","","","","","");
$data_list[10] = array("10","61-01","¡Ú¸½¶âÇä¾å¡Û","¡Ú¥ê¥Ô¡¼¥È¡Û","81","642,210","1,586,420");
$data_list[11] = array("11","61-02","¡Ú¸½¶âÇä¾å¡Û","¡Ú ¾¦¡¡ÉÊ ¡Û","8","485,500","851,450");
$data_list[12] = array("12","61-03","¡Ú¸½¶âÇä¾å¡Û","¡Ú¥ì¥ó¥¿¥ë¡Û","27","146,400","146,400");
$data_list[13] = array("13","61-04","¡Ú¸½¶âÇä¾å¡Û","¡Ú ¤½¤ÎÂ¾ ¡Û","4","-75,640","-75,400");
$data_list[14] = array("14","61-05","¡Ú¸½¶âÇä¾å¡Û","¡Ú ÅÁÉ¼¾ÃÈñÀÇ ¡Û","40","59,924","125,444");
$data_list[15] = array("15","","","¡Ú ÈÎÇä´ÉÍý³°¾¦ÉÊ ¡Û","5","15,360","36,405");
$data_list[16] = array("16","","","¡Ú ¹ç¡¡·× ¡Û","165","1,258,394","2,634,314");
$data_list[17] = array("17","¡Ú»ÅÆþÌÀºÙ¡Û","","","","","");
$data_list[18] = array("18","21-01","¡Ú³Ý»ÅÆþ¡Û","¡Ú¥ê¥Ô¡¼¥È¡Û","34","0","0");
$data_list[19] = array("19","21-02","¡Ú³Ý»ÅÆþ¡Û","¡Ú ÅÁÉ¼¾ÃÈñÀÇ ¡Û","6","0","0");
$data_list[20] = array("20","","","¡Ú ¹ç¡¡·× ¡Û","40","0","0");
$data_list[21] = array("21","¡ÚÆþ¶âÌÀºÙ¡Û","","","","","");
$data_list[22] = array("22","","¡Ú¿¶¹þÆþ¶â¡Û","","","","");
$data_list[23] = array("23","32","0001","¤ß¤º¤Û¶ä¹Ô¡ÊÅöºÂ¡Ë","2","69,090","69,090");
$data_list[24] = array("24","32","0004","²£ÉÍ¶ä¹Ô¡ÊÅöºÂ¡Ë","1","11,655","11,655");
$data_list[25] = array("25","32","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","2","12,390","12,390");
$data_list[26] = array("26","32","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","5","93,135","93,135");
$data_list[27] = array("27","","¡Ú¼ê¿ôÎÁ¡Û","","","","");
$data_list[28] = array("28","35","0001","¤ß¤º¤Û¶ä¹Ô¡ÊÅöºÂ¡Ë","1","420","420");
$data_list[29] = array("29","35","0004","²£ÉÍ¶ä¹Ô¡ÊÅöºÂ¡Ë","1","525","525");
$data_list[30] = array("30","35","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","1","210","210");
$data_list[31] = array("31","35","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","3","1,155","1,155");
$data_list[32] = array("32","37","¡Ú ¤½¤ÎÂ¾Æþ¶â ¡Û","","","","");
$data_list[33] = array("33","","","¡Ú ¤½¤ÎÂ¾Æþ¶â·× ¡Û","1","3,150","3,150");

$data_list[34] = array("34","¡Ú»ÙÊ§ÌÀºÙ¡Û","","","","","");
$data_list[35] = array("35","","¡Ú¿¶¹þÆþ¶â¡Û","","","","");
$data_list[36] = array("36","32","0002","¤ß¤º¤Û¶ä¹Ô","2","69,090","69,090");
$data_list[37] = array("37","32","0003","²£ÉÍ¶ä¹Ô","1","11,655","11,655");
$data_list[38] = array("38","32","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","2","12,390","12,390");
$data_list[39] = array("39","32","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","5","93,135","93,135");
$data_list[40] = array("40","","¡Ú¼ê¿ôÎÁ¡Û","","","","");
$data_list[41] = array("41","35","0001","¤ß¤º¤Û¶ä¹Ô¡ÊÅöºÂ¡Ë","1","420","420");
$data_list[42] = array("42","35","0004","²£ÉÍ¶ä¹Ô¡ÊÅöºÂ¡Ë","1","525","525");
$data_list[43] = array("43","35","0005","²£ÉÍ¿®ÍÑ¶â¸Ë","1","210","210");
$data_list[44] = array("44","35","","¡Ú ¿¶¹þÆþ¶â·× ¡Û","3","1,155","1,155");
$data_list[45] = array("45","37","¡Ú ¤½¤ÎÂ¾Æþ¶â ¡Û","","","","");
$data_list[46] = array("46","","","¡Ú ¤½¤ÎÂ¾Æþ¶â·× ¡Û","1","3,150","3,150");

//align(¥Ç¡¼¥¿)
$data_align[0] = "R";
$data_align[1] = "L";
$data_align[2] = "L";
$data_align[3] = "L";
$data_align[4] = "R";
$data_align[5] = "R";
$data_align[6] = "R";

//***********************************************

//¹àÌÜÉ½¼¨
$posY = $pdf->GetY();
$pdf->SetXY($left_margin, $posY);
for($i=0;$i<count($list)-1;$i++)
{
	$pdf->Cell($list[$i][0], 14, $list[$i][1], '1', '0', $list[$i][2]);
}
$pdf->Cell($list[$i][0], 14, $list[$i][1], '1', '2', $list[$i][2]);

//¥Ç¡¼¥¿É½¼¨
for($j=1;$j<=count($data_list);$j++)
{
	//ÇØ·Ê¿§ÊÑ¹¹¥Õ¥é¥°
	$color_flg = false;
	$posY = $pdf->GetY();
	$pdf->SetXY($left_margin, $posY);
	if($j == 8 || $j == 16 || $j == 20 || $j == 26 || $j == 31 || $j == 33 || $j == 39 || $j == 44 || $j == 46){
		$pdf->SetFillColor(213,213,213);
		$color_flg = true;
	}else if($j == 1 || $j == 17 || $j == 21 || $j == 34){
		$pdf->SetFillColor(145,145,145);
		$color_flg = true;
	}else if($j == 7 || $j == 15){
		$pdf->SetFillColor(255,255,153);
		$color_flg = true;
	}
	for($x=0;$x<6;$x++)
	{
		if($color_flg == true){
			$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '0', $data_align[$x],'1');
		}else{
			$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '0', $data_align[$x]);
		}
	}
	if($color_flg == true){
		$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '2', $data_align[$x],'1');
	}else{
		$pdf->Cell($list[$x][0], 14, $data_list[$j][$x], '1', '2', $data_align[$x]);
	}
}


$pdf->Output();

?>
