<?php

$head = "https://210.196.79.250/amenity/src/head";
$fc   = "https://210.196.79.250/amenity/src/franchise";

$link_arr = array(
    system => "保険料"
);

echo <<<HTML_SRC
**************************************************<br>
契約<br>
**************************************************<br>
■本部<br>
<a href="$head/system/1-1-123.php">契約一覧</a><p>
<a href="$head/system/1-1-104.php">契約登録</a><p>
<a href="$head/sale/1-2-105.html">受注照会</a><p>


**************************************************<br>
保険料<br>
**************************************************<br>
■本部<br>
<a href="$head/system/1-1-131.php">保険料登録</a><p>
<a href="$head/system/1-1-132.php">保険料一覧</a><p>
<!--
<a href="$head/system/1-1-133.php">保険料詳細</a><p>

<a href="$head/sale/1-2-105.php">受注照会</a><p>

■FC<br>
<a href="$fc/buy/2-3-201.php">仕入入力</a><p>
-->

**************************************************<br>
レンタルTOレンタル<br>
**************************************************<br>
■本部<br>
<a href="$head/system/1-1-141.php">レンタルTOレンタル登録</a><p>
<a href="$head/system/1-1-142.php">レンタルTOレンタル一覧</a><p>

■FC<br>
<a href="$fc/system/2-1-141.php">レンタルTOレンタル登録</a><p>
<a href="$fc/system/2-1-142.php">レンタルTOレンタル一覧</a><p>


**************************************************<br>
契約マスタ一括訂正<br>
**************************************************<br>
■FC<br>
<a href="$fc/system/2-1-114.php">契約マスタ一括訂正</a><p>

HTML_SRC;

?>
