<?php

//DB実行
$connect = pg_connect("dbname=amenity user=postgres");
//入力者1
for($x=1;$x<=70;$x++){

	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$x.",".$x.",'入力者1','部門1','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(10 <= $x && 30 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$x.",".$x.",'入力者1','部門1','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(31 <= $x && 50 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$x.",".$x.",'入力者1','部門2','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if($x == 51){
		$sql = "insert into t_op values(".$x.",".$x.",'入力者1','部門3','担当者51','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if($x == 52){
		$sql = "insert into t_op values(".$x.",".$x.",'入力者1','部門3','担当者51','2005-04-02',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(53 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$x.",".$x.",'入力者1','部門4','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	$result = pg_query($connect,$sql);
}

//入力者2
for($x=1;$x<=70;$x++){
	$y = $x + 70;
	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$x.",'入力者2','部門1','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(10 <= $x && 30 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$x.",'入力者2','部門1','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(31 <= $x && 50 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$x.",'入力者2','部門2','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if($x == 51){
		$sql = "insert into t_op values(".$y.",".$x.",'入力者2','部門3','担当者51','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if($x == 52){
		$sql = "insert into t_op values(".$y.",".$x.",'入力者2','部門3','担当者51','2005-04-02',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(53 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$x.",'入力者2','部門4','担当者".$x."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	$result = pg_query($connect,$sql);
}
//入力者3
for($x=1;$x<=70;$x++){
	$y = $x + 140;
	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$y.",'入力者3','部門1','担当者".$y."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(10 <= $x && 30 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$y.",'入力者3','部門1','担当者".$y."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(31 <= $x && 50 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$y.",'入力者3','部門2','担当者".$y."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	if(51 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_op values(".$y.",".$y.",'入力者3','部門4','担当者".$y."','2005-04-01',10000,5000,15000,500,250,10500,5250,15750,10000);";
	}

	$result = pg_query($connect,$sql);
}

?>
