<?php

//DB実行
$connect = pg_connect("dbname=amenity user=postgres");
//倉庫１
for($x=1;$x<=150;$x++){

	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫1','Ｍ区分1','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(10 <= $x && 30 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫1','Ｍ区分2','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(31 <= $x && 50 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫2','Ｍ区分3','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(51 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫2','Ｍ区分4','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(71 <= $x && 90 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫2','Ｍ区分5','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(91 <= $x && 100 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫3','Ｍ区分6','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(101 <= $x && 150 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$x.",'00000001','2005-04-01','倉庫4','Ｍ区分7','商品".$x."','20','20','0','担当者".$x."','');";
	}

	$result = pg_query($connect,$sql);
}

for($x=1;$x<=150;$x++){
	$y = $x + 150;
	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫5','Ｍ区分1','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(10 <= $x && 30 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫5','Ｍ区分2','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(31 <= $x && 50 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫6','Ｍ区分3','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(51 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫6','Ｍ区分4','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(71 <= $x && 90 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫6','Ｍ区分5','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(91 <= $x && 100 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫7','Ｍ区分6','商品".$x."','20','20','0','担当者".$x."','');";
	}

	if(101 <= $x && 150 >= $x){
		//データ挿入SQL
		$sql = "insert into t_diff values(".$y.",'00000001','2005-04-01','倉庫8','Ｍ区分7','商品".$x."','20','20','0','担当者".$x."','');";
	}

	$result = pg_query($connect,$sql);
}


?>
