<?php

//DB実行
$connect = pg_connect("dbname=amenity_test user=postgres");
//担当者１
for($x=1;$x<=150;$x++){

	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース1','順路1','00010001','得意先1','取引区分1','商品1','区分1','10','1000','10000','500','');";
	}

	if(10 <= $x && 30 >= $x){
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース1','順路2','00010002','得意先2','取引区分2','商品1','区分1','10','1000','10000','500','');";
	}

	if(31 <= $x && 50 >= $x){
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース2','順路3','00010003','得意先3','取引区分3','商品1','区分1','10','1000','10000','500','');";
	}

	if(51 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース2','順路4','00010004','得意先4','取引区分4','商品1','区分1','10','1000','10000','500','');";
	}

	if(71 <= $x && 90 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース2','順路5','00010005','得意先5','取引区分5','商品1','区分1','10','1000','10000','500','');";
	}

	if(91 <= $x && 100 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース3','順路6','00010006','得意先6','取引区分6','商品1','区分1','10','1000','10000','500','');";
	}

	if(101 <= $x && 150 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$x.",'担当者1','2005-04-01','コース3','順路7','00010007','得意先7','取引区分7','商品1','区分1','10','1000','10000','500','');";
	}

	$result = pg_query($connect,$sql);
}

//担当者2
for($x=1;$x<=150;$x++){
	$y = $x + 150;
	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース1','順路1','00010001','得意先1','取引区分1','商品1','区分1','10','1000','10000','500','');";
	}

	if(10 <= $x && 30 >= $x){
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース1','順路2','00010002','得意先2','取引区分2','商品1','区分1','10','1000','10000','500','');";
	}

	if(31 <= $x && 50 >= $x){
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース2','順路3','00010003','得意先3','取引区分3','商品1','区分1','10','1000','10000','500','');";
	}

	if(51 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース2','順路4','00010004','得意先4','取引区分4','商品1','区分1','10','1000','10000','500','');";
	}

	if(71 <= $x && 90 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース2','順路5','00010005','得意先5','取引区分5','商品1','区分1','10','1000','10000','500','');";
	}

	if(91 <= $x && 100 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース3','順路6','00010006','得意先6','取引区分6','商品1','区分1','10','1000','10000','500','');";
	}

	if(101 <= $x && 150 >= $x){
		//データ挿入SQL
		$sql = "insert into t_deli values(".$y.",'担当者2','2005-04-01','コース3','順路7','00010007','得意先7','取引区分7','商品1','区分1','10','1000','10000','500','');";
	}

	$result = pg_query($connect,$sql);
}

?>
