<?php

//DB実行
$connect = pg_connect("dbname=amenity user=postgres");
//倉庫１
for($x=1;$x<=150;$x++){

	if(1 <= $x && 10 > $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先1','00000001','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	if(10 <= $x && 30 >= $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先1','00000002','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	if(31 <= $x && 47 >= $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先2','00000003','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	if(48 <= $x && 70 >= $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先2','00000004','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	if(71 <= $x && 90 >= $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先3','00000005','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	if(91 <= $x && 100 >= $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先3','00000006','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	if(101 <= $x && 150 >= $x){
		//データ挿入SQL
		$sql = "insert into t_decision values(".$x.",'得意先3','00000007','2005-04-01','担当者1','商品".$x."','区分1',10,1000,10000,'');";
	}

	$result = pg_query($connect,$sql);
}

?>
