<?php
$page_title = "契約一覧";

//環境設定ファイル
require_once("ENV_local.php");

//HTML_QuickFormを作成
$form =& new HTML_QuickForm("dateForm", "POST", "$_SERVER[PHP_SELF]", null);

// DB接続
$db_con = Db_Connect();


/****************************/
// フォームパーツ作成
/****************************/
// 契約追加ボタン
$form->addElement("button", "form_btn_add_keiyaku", "追　加", "onClick=\"location.href='".HEAD_DIR."system/1-1-104.php'\"");
// レンタル情報追加ボタン
$form->addElement("button", "form_btn_add_rental", "追　加", "onClick=\"location.href='".HEAD_DIR."system/1-1-141.php'\"");
// 保険料情報追加ボタン
$form->addElement("button", "form_btn_add_hoken", "追　加", "onClick=\"location.href='".HEAD_DIR."system/1-1-131.php'\"");


/****************************/
// 一覧表作成
/****************************/

$disp_data1 =   array(
    "0" =>  array(                          // No.毎データ
        "0" =>  "1",                            // 契約情報ID
        "1" =>  "Result1",                      // 行色css
        "2" =>  "毎月10日",                     // 出荷日
        "3" =>  "担当者A",                      // 担当者
        "4" =>  "-",                            // 直送先
        "5" =>  "ヤマト運輸<br>（グリーン）",   // 運送業者
        "6" =>  "倉庫A",                        // 出荷倉庫
        "7" =>  array(                          // 商品毎情報
            "0" =>  array(                          // 商品１
                "00000001",                             // 商品コード
                "商品A",                                // 商品名
                "5",                                    // 数量
                array("200.00", "300.00"),              // 原価単価、売上単価
                array("1000", "1500"),                  // 原価金額、売上金額
            ),
            "1" =>  array(                          // 商品２
                "00000002",
                "商品B",
                "4",
                array("150.00", "300.00"),
                array("600", "1200"),
            ),
            "2" =>  array(                          // 商品３
                "00000003",
                "商品C",
                "2",
                array("1000.00", "1500.00"),
                array("2000", "3000"),
            ),
        ),
        "8" =>  array("3600", "5700"),          // 原価計、売上計
        "9" =>  "",                             // 備考
    ),
    "1" =>  array(                          // No.毎データ
        "0" =>  "2",                            // 契約情報ID
        "1" =>  "Result2",                      // 行色css
        "2" =>  "A週火曜日",                    // 出荷日
        "3" =>  "担当者B",                      // 担当者
        "4" =>  "-",                            // 直送先
        "5" =>  "ヤマト運輸<br>（グリーン）",   // 運送業者
        "6" =>  "倉庫B",                        // 出荷倉庫
        "7" =>  array(                          // 商品毎情報
            "0" =>  array(                          // 商品１
                "00000010",                             // 商品コード
                "商品W",                                // 商品名
                "5",                                    // 数量
                array("200.00", "300.00"),              // 原価単価、売上単価
                array("1000", "1500"),                  // 原価金額、売上金額
            ),
            "1" =>  array(                          // 商品２
                "00000011",
                "商品X",
                "4",
                array("150.00", "300.00"),
                array("600", "1200"),
            ),
            "2" =>  array(                          // 商品３
                "00000012",
                "商品Y",
                "2",
                array("1000.00", "1500.00"),
                array("2000", "3000"),
            ),
            "3" =>  array(                          // 商品４
                "00000003",
                "商品Z",
                "2",
                array("1000.00", "1500.00"),
                array("2000", "3000"),
            ),
        ),
        "8" =>  array("4600", "7200"),          // 原価計、売上計
        "9" =>  "",                             // 備考
    ),
);

$disp_data2 =   array(
    "0" =>  array(                          // No.毎データ
        "0" =>  "1",                            // レンタルID
        "1" =>  "Result1",                      // 行色css
        "2" =>  "2006-06-09",                   // レンタル開始日
        "3" =>  "バブ日立ソフト",               // お客様命
        "4" =>  "045-xxx-xxxx",                 // TEL
        "5" =>  "123-4567",                     // 郵便番号
        "6" =>  "神奈川県横浜市磯子区磯子",     // 住所１
        "7" =>  "システムプラザ磯子2号館",      // 住所２(？)
        "8" =>  "2006-06-08",                   // レンタル申込日
        "9" =>  array(                          // 商品毎情報
            "0" =>  array(                          // 商品１
                "00000001",                             // 商品コード
                "センサXTOTO",                          // 商品名
                array("0001", "0002", "0003", "0004", "0005"),  // シリアル
                "5",                                    // 数量
                "1000",                                 // レンタル料
                "5000",                                 // レンタル金額
            ),
            "1" =>  array(                          // 商品２
                "00000002",
                "自動水栓 せせらぎ",
                array("1001", "1002"),
                "5",
                "900",
                "4500",
            ),
            "2" =>  array(                          // 商品３
                "00000003",
                "シートクリーナー本体",
                "9999",
                "5",
                "200",
                "1000",
            ),
        ),
        "10" =>  "備考１",                       // 備考
    ),
    "1" =>  array(                          // No.毎データ
        "0" =>  "2",                            // レンタルID
        "1" =>  "Result2",                      // 行色css
        "2" =>  "2006-06-09",                   // レンタル開始日
        "3" =>  "バブ日立ソフト",               // お客様命
        "4" =>  "045-xxx-xxxx",                 // TEL
        "5" =>  "123-4567",                     // 郵便番号
        "6" =>  "神奈川県横浜市磯子区磯子",     // 住所１
        "7" =>  "システムプラザ磯子2号館",      // 住所２(？)
        "8" =>  "2006-06-08",                   // レンタル申込日
        "9" =>  array(                          // 商品毎情報
            "0" =>  array(                          // 商品１
                "00000001",                             // 商品コード
                "センサXTOTO",                          // 商品名
                array("0006", "0007", "0008", "0009", "0010"),  // シリアル
                "5",                                    // 数量
                "1000",                                 // レンタル料
                "5000",                                 // レンタル金額
            ),
        ),
        "10" =>  "備考２",                       // 備考
    ),
    "2" =>  array(                          // No.毎データ
        "0" =>  "3",                            // レンタルID
        "1" =>  "Result1",                      // 行色css
        "2" =>  "2006-06-09",                   // レンタル開始日
        "3" =>  "バブ日立ソフト",               // お客様命
        "4" =>  "045-xxx-xxxx",                 // TEL
        "5" =>  "123-4567",                     // 郵便番号
        "6" =>  "神奈川県横浜市磯子区磯子",     // 住所１
        "7" =>  "システムプラザ磯子2号館",      // 住所２(？)
        "8" =>  "2006-06-08",                   // レンタル申込日
        "9" =>  array(                          // 商品毎情報
            "0" =>  array(                          // 商品１
                "00000001",                             // 商品コード
                "センサXTOTO",                          // 商品名
                array("0016", "0017", "0018", "0019", "0020"),  // シリアル
                "5",                                    // 数量
                "1000",                                 // レンタル料
                "5000",                                 // レンタル金額
            ),
            "1" =>  array(                          // 商品２
                "00000002",
                "自動水栓 せせらぎ",
                array("1011", "1012"),
                "5",
                "900",
                "4500",
            ),
            "2" =>  array(                          // 商品３
                "00000003",
                "シートクリーナー本体",
                "",
                "5",
                "200",
                "1000",
            ),
            "3" =>  array(                          // 商品３
                "00000010",
                "商品A",
                "",
                "5",
                "200",
                "1000",
            ),
        ),
        "10" =>  "備考３",                       // 備考
    ),
    "3" =>  array(                          // No.毎データ
        "0" =>  "4",                            // レンタルID
        "1" =>  "Result2",                      // 行色css
        "2" =>  "2006-06-09",                   // レンタル開始日
        "3" =>  "バブ日立ソフト",               // お客様命
        "4" =>  "045-xxx-xxxx",                 // TEL
        "5" =>  "123-4567",                     // 郵便番号
        "6" =>  "神奈川県横浜市磯子区磯子",     // 住所１
        "7" =>  "システムプラザ磯子2号館",      // 住所２(？)
        "8" =>  "2006-06-08",                   // レンタル申込日
        "9" =>  array(                          // 商品毎情報
            "0" =>  array(                          // 商品１
                "00000001",                             // 商品コード
                "センサXTOTO",                          // 商品名
                array("0021", "0022", "0023", "0024", "0025"),  // シリアル
                "5",                                    // 数量
                "1000",                                 // レンタル料
                "5000",                                 // レンタル金額
            ),
            "1" =>  array(                          // 商品２
                "00000002",
                "自動水栓 せせらぎ",
                array("1021", "1022"),
                "5",
                "900",
                "4500",
            ),
        ),
        "10" =>  "備考４",                       // 備考
    ),
);

$disp_data3 =   array(
    "0" =>  array(                              // 保険毎データ
        "0" =>  array(                              // 保険１
            "1",                                        // 保険料ID
            "Result1",                                  // 行色css
            "障害保険",                                 // 種別
            "16",                                       // 人数
            "10,240",                                   // 原価
            "10,240",                                   // 合計
        ),
        "1" =>  array(                              // 保険２
            "2",
            "Result2",
            "賠償保険",
            "16",
            "9,490",
            "9,490",
        ),
        "2" =>  array(                              // 保険３
            "3",
            "Result1",
            "共済（代表者）",
            "0",
            "6,000",
            "0",
        ),
        "3" =>  array(                              // 保険４
            "4",
            "Result2",
            "共済（従業員）",
            "16",
            "3,000",
            "48,000",
        ),
    ),
    "1" =>  "57,490",                       // 総計
    "2" =>  "",                             // 備考
);

/****************************/
//HTMLヘッダ
/****************************/
$html_header = Html_Header($page_title);

/****************************/
//HTMLフッタ
/****************************/
$html_footer = Html_Footer();

/****************************/
//ディレクトリ
/****************************/
$head_page = HEAD_DIR."system/1-1-104.php";

/****************************/
//メニュー作成
/****************************/
$page_menu = Create_Menu_h("system", "1");

/****************************/
//画面ヘッダー作成
/****************************/
$page_header = Create_Header($page_title);


// Render関連の設定
$renderer =& new HTML_QuickForm_Renderer_ArraySmarty($smarty);
$form->accept($renderer);

//form関連の変数をassign
$smarty->assign("form", $renderer->toArray());

//その他の変数をassign
$smarty->assign("var", array(
    "html_header"   => "$html_header",
    "page_menu"     => "$page_menu",
    "page_header"   => "$page_header",
    "html_footer"   => "$html_footer",
    "head_page"     => "$head_page",    
));

//表示データ
$smarty->assign("disp_data1", $disp_data1);
$smarty->assign("disp_data2", $disp_data2);
$smarty->assign("disp_data3", $disp_data3);

//テンプレートへ値を渡す
$smarty->display(basename($_SERVER[PHP_SELF] .".tpl"));

?>
